viv_turbulence/constant/dynamicMeshDict_dev
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


mover
{	type            motionSolver; // none; for static mesh

	libs            ("libfvMeshMovers.so" "libsixDoFRigidBodyMotion.so");

	motionSolver    sixDoFRigidBodyMotion;


    patches         (cylinder);
    innerDistance   0.0;
    outerDistance   3.0;

    centreOfMass    (0.0 0.0 1.0);

    // Cuboid dimensions
    //Lx              1.0;
    //Ly              0.24;
    //Lz              0.4;

    // Density of the solid
    rhoSolid        2.0; //kg/m3

    // cylinder mass
    mass            5.026; //kg

    // cylinder moment of inertia about the centre of mass
    momentOfInertia (0.1 0.1 0.1); // neglected because no rotation is considered
    g               (0 0 0); // neglected gravity
	rho             rhoInf;
	rhoInf          1.0;
	report          on;

    report          on;
    accelerationRelaxation 0.9;
    //accelerationDamping    0.9;


    solver
    {
        type Newmark;
    }

    constraints
    {

        /*
        fixedPoint
        {
             sixDoFRigidBodyMotionConstraint point;
             centreOfRotation (0.5 0.45 0.1);
        }
        */

        fixedLine // Used to define motion direction. Other directions will be neglected
        {
            sixDoFRigidBodyMotionConstraint line;
            direction (0 1 0);
        }

	   noRotation  // Used to prevent rotation
	   {
		   sixDoFRigidBodyMotionConstraint   orientation;
		   centreOfRotation                 (0 0 1);
	   }

        
        /*fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 0 1);
        }*/
        
    }

restraints
{
    verticalSpring
    {
        sixDoFRigidBodyMotionRestraint linearSpring;

        anchor          (0 0 0);
        refAttachmentPt (0 0 0);
        stiffness       7.937;
        damping         0;
        restLength      0;
    }

    
}

}

// ************************************************************************* //
