viv_turbulence/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375; // 0.061%

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00375;
    }

    outlet
    {
        type            zeroGradient;
    }

    cylinder
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    top
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    bottom
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    sides
    {
        type            symmetry;
    }

   
}


// ************************************************************************* //
