viv_turbulence/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    

    cylinder
    {
        type            calculated;
        uniformValue    (0 0 0);
    }
    
    top
    {
        type            calculated;
        uniformValue    (0 0 0);
    }
    
    sides
    {
        type            symmetry;
    }

    ".*"
    {
        type            fixedValue;
        value uniform    (0 0 0);
    }
}

// ************************************************************************* //
